[
    {
        "Id" : 1,
        "Title" : "Red Dead Redemption 2",
        "Summary" : "Red Dead Redemption 2 is an epic open-world Western adventure game featuring immersive storytelling, rich characters, and stunning visuals set in 1899 America.",
        "Overview" : "Red Dead Redemption 2 is a critically acclaimed open-world action-adventure game developed by Rockstar Games. Set in 1899 during the decline of the American frontier, it follows Arthur Morgan, a member of the Van der Linde gang, as he navigates loyalty, survival, and morality in a rapidly changing world. The game offers a deeply immersive experience with cinematic storytelling, dynamic weather, realistic wildlife, and expansive environments ranging from snowy mountains to swamps and bustling towns. With its compelling narrative, complex characters, and attention to detail, RDR2 is considered one of the greatest video games of all time.",
        "Price": 20.00,
        "Category" : "Action",
        "ReleaseDate": "2022-06-03",
        "Publisher": "Rockstar",
        "Ratings":82,
        "ImageUrl": "../Images/GameCovers/RDR2.jpg",
        "IngameUrls":["../Images/InGame/RDR2/1.jpg","../Images/InGame/RDR2/2.jpg","../Images/InGame/RDR2/3.jpg"]
    },
    {
        "Id" : 2,
        "Title" : "PUBG",
        "Summary" : "PUBG (PlayerUnknown's Battlegrounds) is a battle royale shooter where up to 100 players fight to be the last one standing.",
        "Overview" : "PUBG (PlayerUnknown's Battlegrounds) is a pioneering online multiplayer battle royale game developed by PUBG Corporation, a subsidiary of Bluehole Studio. In this intense, last-man-standing shooter, up to 100 players parachute onto a remote island where they must scavenge for weapons, equipment, and resources while fighting to be the sole survivor. The game features a shrinking play zone that forces players into increasingly tighter confrontations, creating high-stakes tension and strategy.",
        "Price": 10.00,
        "Category" : "Shooter",
        "ReleaseDate": "2018-06-03",
        "Publisher": "Tencent",
        "Ratings":85,
        "ImageUrl": "../Images/GameCovers/PUBG.jpg",
        "IngameUrls":["../Images/InGame/PUBG/3.jpg","../Images/InGame/PUBG/2.jpg","../Images/InGame/PUBG/1.webp"]
    },
    {
        "Id" : 3,
        "Title" : "Devil May Cry 5",
        "Summary" : "Devil May Cry 5 is a fast-paced action game where players control demon hunters Nero, Dante, and V as they battle demonic forces in a stylish, combo-driven combat system.",
        "Overview" : "Devil May Cry is a renowned action-adventure hack-and-slash video game series developed and published by Capcom. The franchise centers around Dante, a stylish, cocky demon hunter with a tragic past, who battles demonic forces threatening the human world. Known for its fast-paced combat, fluid combo systems, and over-the-top action, Devil May Cry combines gothic horror aesthetics with high-octane gameplay and an engaging storyline steeped in mythology, betrayal, and family drama.",
        "Price": 25.00,
        "Category" : "Action",
        "ReleaseDate": "2022-07-03",
        "Publisher": "Capcom",
        "Ratings":81,
        "ImageUrl": "../Images/GameCovers/DMC5.jpg",
        "IngameUrls":["../Images/InGame/DMC5/1.jpg","../Images/InGame/DMC5/2.jpg","../Images/InGame/DMC5/3.jpg"]
    },
    {
        "Id" : 4,
        "Title" : "God of War",
        "Summary" : "God of War is an action-adventure game that follows Kratos, a former Greek god, on a journey with his son Atreus through Norse mythology",
        "Overview" : "God of War (GoW) is a critically acclaimed action-adventure game franchise developed by Santa Monica Studio and published by Sony Interactive Entertainment. Originally debuting in 2005 on the PlayStation 2, the series follows Kratos, a Spartan warrior turned god, known for his brutal combat style, tragic backstory, and relentless pursuit of vengeance. Deeply rooted in Greek mythology in its earlier titles, God of War blends intense hack-and-slash combat with epic storytelling and mythological lore.",
        "Price": 40.00,
        "Category" : "RPG",
        "ReleaseDate": "2021-02-03",
        "Publisher": "Sony",
        "ImageUrl": "../Images/GameCovers/GOW.jpg",
        "IngameUrls":["../Images/InGame/GOW/1.avif","../Images/InGame/GOW/2.webp","../Images/InGame/GOW/3.jpg"],
        "Ratings":93
    },
    {
        "Id" : 5,
        "Title" : "FIFA 23",
        "Summary" : "FIFA 23 is a football simulation game by EA Sports featuring realistic gameplay, men's and women's World Cups",
        "Overview" : "FIFA 23 is the 30th and final installment in EA Sports’ long-running football simulation series under the FIFA name, released globally on September 30, 2022, for PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, Nintendo Switch, Stadia, and PC . It marks the end of EA’s partnership with FIFA, with future titles continuing under the new EA Sports FC branding",
        "Price": 23.00,
        "Category" : "Sports",
        "ReleaseDate": "2023-09-04",
        "Publisher": "EA",
        "Ratings":77,
        "ImageUrl": "../Images/GameCovers/FIFA.jpg",
        "IngameUrls":["../Images/InGame/FIFA/1.webp","../Images/InGame/FIFA/2.jpg","../Images/InGame/FIFA/3.jpg"]
    },
    {
        "Id" : 6,
        "Title" : "Far Cry 5",
        "Summary" : "Far Cry 5 is an open-world first-person shooter where you fight against a dangerous cult in rural Montana.",
        "Overview" : "Far Cry 5 is an open-world first-person shooter developed by Ubisoft and released in 2018. Set in the fictional Hope County, Montana, the game places players in the role of a rookie sheriff’s deputy sent to arrest Joseph Seed, the charismatic and dangerous leader of a doomsday cult known as The Project at Eden's Gate. What begins as a routine mission quickly descends into chaos as Seed’s followers violently resist, plunging the region into lawlessness.",
        "Price": 44.00,
        "Category" : "Action",
        "ReleaseDate": "2020-02-04",
        "Publisher": "Ubisoft",
        "Ratings":77,
        "ImageUrl": "../Images/GameCovers/FC5.jpg",
        "IngameUrls":["../Images/InGame/FC5/1.jpg","../Images/InGame/FC5/2.jpg","../Images/InGame/FC5/3.avif"]
    },
    {
        "Id" : 7,
        "Title" : "Ghost of Tsushima",
        "Summary" : "Ghost of Tsushima is an open-world samurai action game set in feudal Japan, blending cinematic storytelling with stealth, swordplay, and beautiful natural landscapes",
        "Overview" : "Ghost of Tsushima is a critically acclaimed open-world action-adventure game developed by Sucker Punch Productions and published by Sony Interactive Entertainment, released in 2020 exclusively for PlayStation consoles. Set in 1274 during the first Mongol invasion of Japan, the game follows Jin Sakai, a noble samurai warrior who must evolve into the Ghost, a shadowy protector, in order to defend his home island of Tsushima from overwhelming enemy forces.",
        "Price": 22.00,
        "Category" : "Action",
        "ReleaseDate": "2020-04-04",
        "Publisher": "Sony",
        "Ratings":97,
        "ImageUrl": "../Images/GameCovers/GOT.jpg",
        "IngameUrls":["../Images/InGame/GOT/3.jpg","../Images/InGame/GOT/2.jpg","../Images/InGame/GOT/1.avif"]
    },
    {
        "Id" : 8,
        "Title" : "Forza Horizon 5",
        "Summary" : "Forza Horizon 5 is an open-world racing game set in Mexico, featuring dynamic weather, stunning visuals, and hundreds of customizable cars across diverse landscapes.",
        "Overview" : "Forza Horizon 5, developed by Playground Games and published by Xbox Game Studios, is an award-winning open-world racing game released in November 2021 for Xbox Series X|S, Xbox One, and PC. As the fifth entry in the Horizon sub-series of the Forza franchise, it builds on its predecessors with its most expansive and diverse world yet—set in a beautifully recreated version of Mexico.",
        "Price": 60.00,
        "Category" : "Racing",
        "ReleaseDate": "2024-05-03",
        "Publisher": "XBOX",
        "Ratings":77,
        "ImageUrl": "../Images/GameCovers/FH5.jpg",
        "IngameUrls":["../Images/InGame/FH5/1.webp","../Images/InGame/FH5/2.jpg","../Images/InGame/FH5/3.webp"]
    },
    {
        "Id" : 9,
        "Title" : "Cyberpunk 2077",
        "Summary" : "Cyberpunk 2077 is an open-world RPG set in dystopian Night City, blending deep storytelling, futuristic tech, and intense action in a sprawling neon-lit world.",
        "Overview" : "Cyberpunk 2077, developed by CD Projekt Red, is a highly ambitious open-world role-playing game released in December 2020. Set in the sprawling, dystopian metropolis of Night City in the year 2077, the game immerses players in a gritty, neon-soaked future where technology and body augmentation blur the lines between human and machine.",
        "Price": 10.00,
        "Category" : "RPG",
        "ReleaseDate": "2022-02-03",
        "Publisher": "Sony",
        "Ratings":87,
        "ImageUrl": "../Images/GameCovers/CP.jpg",
        "IngameUrls":["../Images/InGame/CP/1.jpg","../Images/InGame/CP/2.jpg","../Images/InGame/CP/3.webp"]
    },
    {
        "Id" : 10,
        "Title" : "Uncharted 4: A Thief's End",
        "Summary" : "Uncharted 4 is an action-adventure game featuring treasure hunter Nathan Drake’s final journey, blending cinematic storytelling, thrilling exploration, and intense third-person combat.",
        "Overview" : "Uncharted 4: A Thief’s End, developed by Naughty Dog and released in 2016 for PlayStation 4, is the critically acclaimed conclusion to Nathan Drake’s epic treasure-hunting saga. The game follows Drake as he’s pulled out of retirement by his long-lost brother, Sam, leading them on a globe-trotting adventure in search of the legendary pirate treasure of Henry Avery.",
        "Price": 45.00,
        "Category" : "Action",
        "ReleaseDate": "2020-09-03",
        "Publisher": "Sony",
        "Ratings":78,
        "ImageUrl": "../Images/GameCovers/U4.jpg",
        "IngameUrls":["../Images/InGame/U4/1.jpg","../Images/InGame/U4/2.jpg","../Images/InGame/U4/3.avif"]
    },
    {
        "Id" : 11,
        "Title" : "Assassin’s Creed: Shadows",
        "Summary" : "Assassin’s Creed: Shadows is a stealth-action mobile game featuring Evie Frye navigating Victorian London’s shadows, using stealth, gadgets, and combat to unravel conspiracies.",
        "Overview" : "Assassin’s Creed: Shadows is a mobile stealth-action game developed by Ubisoft, set in the rich world of Victorian London during the late 19th century. The game puts players in control of Evie Frye, a skilled Assassin and one of the protagonists from Assassin’s Creed Syndicate. Players guide Evie through a variety of missions focused on stealth, strategic gadget use, and precise combat.",
        "Price": 60.00,
        "Category" : "Action",
        "ReleaseDate": "2025-09-03",
        "Publisher": "Ubisoft",
        "Ratings":98,
        "ImageUrl": "../Images/GameCovers/ACS.jpg",
        "IngameUrls":["../Images/InGame/ACS/1.avif","../Images/InGame/ACS/2.avif","../Images/InGame/ACS/3.jpg"]
    },
    {
        "Id" : 12,
        "Title" : "Tekken 8",
        "Summary" : "Tekken 8 is the latest installment in the iconic fighting game series, featuring stunning graphics, fast-paced combat, and a deep story continuing the Mishima saga.",
        "Overview" : "Tekken 8 is the highly anticipated next entry in the legendary Tekken fighting game franchise developed by Bandai Namco Entertainment. Building on decades of competitive and story-driven gameplay, Tekken 8 promises to deliver a thrilling blend of intense martial arts combat, cutting-edge visuals powered by the Unreal Engine 5, and an emotionally charged continuation of the Mishima family saga.",
        "Price": 50.00,
        "Category" : "Fighting",
        "ReleaseDate": "2024-09-03",
        "Publisher": "Bandai Namco",
        "Ratings":77,
        "ImageUrl": "../Images/GameCovers/T8.jpg",
        "IngameUrls":["../Images/InGame/T8/1.webp","../Images/InGame/T8/2.jpg","../Images/InGame/T8/3.webp"]
    },
    {
        "Id" : 13,
        "Title" : "Resident Evil 4 Remake",
        "Summary" : "Resident Evil 4 is a survival horror game where Leon Kennedy fights infected villagers in rural Spain, blending intense action, exploration, and atmospheric storytelling.",
        "Overview" : "Resident Evil 4, developed and published by Capcom, is a landmark survival horror game originally released in 2005. It revolutionized the series by shifting from fixed camera angles to an over-the-shoulder third-person perspective, offering a more immersive and action-oriented experience.",
        "Price": 30.00,
        "Category" : "Horror",
        "ReleaseDate": "2023-09-03",
        "Publisher": "Capcom",
        "Ratings":79,
        "ImageUrl": "../Images/GameCovers/RE4.jpg",
        "IngameUrls":["../Images/InGame/RE4/1.webp","../Images/InGame/RE4/2.jpg","../Images/InGame/RE4/3.jpg"]
    },
    {
        "Id" : 14,
        "Title" : "The Last of Us",
        "Summary" : "The Last of Us is a gripping post-apocalyptic action-adventure about survival, love, and loss, following Joel and Ellie across a devastated, infected America.",
        "Overview" : "The Last of Us, developed by Naughty Dog and released in 2013 for PlayStation 3 (later remastered and remade), is a groundbreaking action-adventure game set in a post-apocalyptic United States ravaged by a deadly fungal outbreak. The narrative follows Joel, a hardened survivor, and Ellie, a teenage girl who may hold the key to humanity’s survival, as they journey across a ruined nation filled with danger, both human and infected.",
        "Price": 42.00,
        "Category" : "Action",
        "ReleaseDate": "2023-09-03",
        "Publisher": "Sony",
        "Ratings":66,
        "ImageUrl": "../Images/GameCovers/TLOU.jpg",
        "IngameUrls":["../Images/InGame/TLOU/1.jpg","../Images/InGame/TLOU/2.avif","../Images/InGame/TLOU/3.jpg"]
    },
    {
        "Id" : 15,
        "Title" : "Elden Ring",
        "Summary" : "Elden Ring is an open-world action RPG by FromSoftware, blending challenging combat, rich lore, and deep exploration in a vast, mysterious fantasy realm.",
        "Overview" : "Elden Ring, developed by FromSoftware and published by Bandai Namco Entertainment, is an open-world action role-playing game released in February 2022. Directed by Hidetaka Miyazaki, with worldbuilding contributions from author George R. R. Martin, the game expands on the studio’s signature formula of challenging combat, cryptic storytelling, and deep lore.",
        "Price": 60.00,
        "Category" : "RPG",
        "ReleaseDate": "2022-09-03",
        "Publisher": "FromSoftware",
        "Ratings":83,
        "ImageUrl": "../Images/GameCovers/ER.jpg",
        "IngameUrls":["../Images/InGame/ER/1.jpg","../Images/InGame/ER/2.webp","../Images/InGame/ER/3.jpg"]
    },
    {
        "Id" : 16,
        "Title" : "Spider-Man 2",
        "Summary" : "Marvel’s Spider-Man 2 features Peter Parker and Miles Morales teaming up in a thrilling open-world adventure to face new threats like Venom and Kraven.",
        "Overview" : "Marvel’s Spider-Man 2, developed by Insomniac Games and released in 2023 for PlayStation 5, is the highly anticipated sequel to Marvel’s Spider-Man (2018) and Miles Morales (2020). This action-packed open-world game continues the story of both Peter Parker and Miles Morales as they protect New York City from a rising tide of powerful threats.",
        "Price": 60.00,
        "Category" : "Action",
        "ReleaseDate": "2024-09-03",
        "Publisher": "EA",
        "Ratings":55,
        "ImageUrl": "../Images/GameCovers/SM2.jpg",
        "IngameUrls":["../Images/InGame/SM2/1.jpg","../Images/InGame/SM2/2.jpg","../Images/InGame/SM2/3.jpg"]
    }
    
]